// الگوریتم

// یه عدد از پرامت میگیریم و داخل یه متغیر میریزیم
// عدد رو اسپلیت میزنیم
// روی ارایه بدست امده ی حلقه میزنیم
// و هر کدام از ایندکس هاشو باقیماندش تقسیم بر دو رو حساب میکینم
// اگر باقیمانده صفر شد درون یه متغییر ارایه میریزیم
//و اگر صفر نشد درون یه متغییر ارایه دیگه میریزیم
// و اگر مساوی با صفر بود درون یه متغییر دیگه میریزیم
// و در اخر درون کنسول تعداد خانه های هر متغییر رو برمیگردونیم
// برای مثال اگر سه تا عدد زوج بود تعداد خانه ها میشه 3 تا و داخل کنسول تعداد خانه ها رو نوشته و جلوش زوج رو مینویسیم
