function binarySearch(value, list) {
    let first = 0;
    let last = list.length - 1;
    let position = -1;
    let found = false;
    let middle;
    while (found === false && first <= last) {
        middle = Math.floor((first + last) / 2);
        if (list[middle] == value) {
            found = true;
            position = middle;
        } else if (list[middle] > value) {
            last = middle - 1;
        } else {
            first = middle + 1;
        }
    }
    return position;
}

console.log(binarySearch(5, [1, 2, 3, 4, 5, 6, 7, 8, 9, 10]));



// الگوریتم
// یه فانکشن داریم که یه حدس از ما میگیره و یه لیست مرتب هم میگیره
// میاد یه متغییر تعریف میکنه برای شروع یه متغییر برای پایان یه متغییر برای ایندکس عدد داده شده یه متغییر برای وقتی درست حدس زدیم یکی هم برای وقتی مساوی بود
// میاد داخل یه حلقه میگه که تا زمانی که متغییر ما فالس هست و فرست کوچک تر از لست هست ادامه بده
// بعد وسط ارایه رو حساب میکینم برای مثال 5 بین ارایه ی 10 تایی
//بعد بررسی میکنیم اگر وسط ارایه ما مساوی بود با عدد ما متغیر ما ترو بشه
// اگر وسط ارایه ما بزرگ تر از عدد بود میاد لست رو منهای یک میکنه و اندیس رو برمیگردونه
// اگر کوچک تر بود به علاوه یک میکنه و برمیگردونه
// و در اخر ریترن میکنه اندیس عدد ما رو